#include <iostream>
#include <fstream>

using namespace std;

int main()
	{
		// метод трапеций
		int a = 9;
		double h = 0;
		double result = 0;
		
		double f[a] = {0.000, 0.021470, 0.293050, 0.494105, 0.541341, 0.516855, 0.468617 , 0.416531, 0.367879};
		
		double x[a] = {0, 0.125, 0.25, 0.375, 0.5, 0.625, 0.75, 0.875, 1};
		
		for(int i = 0; i < a; i++)
			{	
				cout<<x[i]<<" || "<< f[i] << endl;
			}

		ofstream fout("load.txt");   
             
                  for (int i = 0; i < a; i++)
                  	{
                    	fout<< x[i]<<"\t "<<f[i]<<endl;
                  	}
                 
                 fout.close();



		h = (x[8] - x[0])/ 8;
		
		cout << "----------------------------------------------------- " << endl;
		
		cout <<"шаг = " << h << endl;
		
		cout << "----------------------------------------------------- " << endl;
		
		result = h * (((f[0] +f[8]) / 2) + f[1] + f[2] + f[3] + f[4] + f[5] + f[6] + f[7]);

		cout << "результат для метода трапеций" << endl;
		
		cout<<"result = " << result << endl;
		
		cout << "----------------------------------------------------- " << endl;

		









		// метод симпосона
		double p = 0;
		double s = 0;
		double result1 = 0;

		
		
		s = (x[8] - x[0])/ 8;

		cout << "шаг = "<< s << endl;
		
		cout << "----------------------------------------------------- " << endl;
		
		result1 = (s/3) * (f[0] + f[8] + 2*(f[2]+f[4]+f[6])+ 4*(f[1]+f[3]+f[5]+f[7]));

		cout << "результат для метода симпосона" << endl;

		cout<<"result = " << result1 << endl;
		
		cout << "----------------------------------------------------- " << endl;
		
		p = result - result1;
		
		cout<<"погрешность между методами = " << p << endl;
		
		cout << "----------------------------------------------------- " << endl;
		
		cout << "Правило Рунге" << endl;
		

		ofstream fout1("ans1.dat");   
       
        fout1 << result << "    " << p <<endl;
            
        fout1.close();

        


        ofstream fout2("ans2.dat");   
       
        fout2 << result1 << "    " << p <<endl;
            
        fout2.close();

		

		//правило рунге
		int k = 17;
		double result2 = 0;
		double n = 0;
		double b = 0;
		double x2[k] = {0};
		double f2[k] = {0.000, 0.010735, 0.021470, 0.15726, 0.293050, 0.393577, 0.494105, 0.517723, 0.541341, 0.529098, 0.516855, 0.492736, 0.468617, 0.442574 , 0.416531, 0.392205 , 0.367879};
		
		
		
		x2[0] = 0;
		x2[1] = 0.0625;
		x2[2] = x2[1] + 0.0625;
		x2[3] = x2[2] + 0.0625;
		x2[4] = x2[3] + 0.0625;
		x2[5] = x2[4] + 0.0625;
		x2[6] = x2[5] + 0.0625;
		x2[7] =	x2[6] + 0.0625;
		x2[8] = x2[7] + 0.0625;
		x2[9] = x2[8] + 0.0625;
		x2[10] = x2[9] + 0.0625;
		x2[11] = x2[10] + 0.0625;
		x2[12] = x2[11] + 0.0625;
		x2[13] = x2[12] + 0.0625;
		x2[14] = x2[13] + 0.0625;
		x2[15] = x2[14] + 0.0625;
		x2[16] = x2[15] + 0.0625;
		x2[17] = x2[16] + 0.0625;
		
		n = (x2[16] - x2[0]) / 16;

		cout<<"шаг = " << n << endl;
		
		cout << "----------------------------------------------------- " << endl;


		for(int i = 0; i < k; i++)
			{	
				cout<<x2[i]<<" || "<< f2[i] << endl;
			}

		result2 = (n/3) * (f2[0] + f2[16] + 2*(f2[2]+f2[4]+f2[6]+f2[8]+f2[10]+f2[12]+f2[14])+ 4*(f2[1]+f2[3]+f2[5]+f2[7]+f2[9]+f2[11]+f2[13]+f2[15]));

		cout << "результат для правила Рунге" << endl;
		
		cout <<"result = "<< result2 << endl;

		b = result2 - result1;

		cout << b << endl;
			

		



		return 0;
	} 
